<?php

// Определение функции
function f($x) {
    return pow($x, 2) - 7 * $x - 6;
}

// Реализация метода Дихотомии
function bisection($x0, $x1, $e) {
    $step = 1;
    echo "\n\n*** РЕАЛИЗАЦИЯ МЕТОДА ПОЛОВИННОГО ДЕЛЕНИЯ ***\n";
    $condition = true;
    while ($condition) {
        $x2 = ($x0 + $x1) / 2;
        printf("Итерация-%d, x2 = %0.6f и f(x2) = %0.6f\n", $step, $x2, f($x2));

        if (f($x0) * f($x2) < 0) {
            $x1 = $x2;
        } else {
            $x0 = $x2;
        }

        $step++;
        $condition = abs(f($x2)) > $e;
    }

    printf("\nТребуемый корень : %0.8f\n", $x2);
}

// Секция ввода
$x0 = readline('Первое предположение: ');
$x1 = readline('Второе предположение: ');
$e = readline('Допустимая погрешность: ');

// Преобразование входных данных в тип float
$x0 = (float)$x0;
$x1 = (float)$x1;
$e = (float)$e;

// Проверка корректности начальных значений и проведение бисекции
if (f($x0) * f($x1) > 0.0) {
    echo "Данные начальные предположения не ограничивают корень.\n";
    echo "Попробуйте снова с другими предположениями.\n";
} else {
    bisection($x0, $x1, $e);
}
?>
